Flat-Plate-kepsilon/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (69.26 0 0);

boundaryField
{
    inlet
    {
	type 	fixedValue;
	value	uniform (69.26 0 0);
    }

    outlet
    {
	type 	zeroGradient;	
    }

    top
    {
	type 	zeroGradient;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    slipsurface
    {
	type 		symmetryPlane;
    }

    frontandback
    {
	type	empty;
    }
}


// ************************************************************************* //
