Flat-Plate-kepsilon/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0024;//0.000103743095;//0.0000375;//0.00081206;//0.075957;//0.00081206;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0024;//0.000103743095;//0.0000375;//0.00081206;//0.075957;//0.00081206;
    }
    top
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    slipsurface
    {
        type            symmetryPlane;
    }
    bottom
    {
        type            kqRWallFunction;
        value           uniform 0;//0.00081206;//0.075957;//0.00081206;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
