Flat-Plate-kepsilon/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
	type 	zeroGradient;
    }

    outlet
    {
           type         fixedValue;
	value 		uniform 0;
    }

    top
    {
        type 	zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    slipsurface
    {
        type            symmetryPlane;//zeroGradient;
    }
    frontandback
    {
	type	empty;
    }
}

// ************************************************************************* //
