Flat-Plate-kepsilon/0/uPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      uPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (20.6023 0 0);

boundaryField
{
    frontandback
    {
        type            empty;
    }
    top
    {
        type            calculated;
        value           uniform (20.6023 0 0);
    }
    slipsurface
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform (20.6023 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (20.6023 0 0);
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
