Flat-Plate-kepsilon/0/y
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
34402
(
2.00442
1.93549
1.86914
1.80525
1.74377
1.68459
1.62765
1.57286
...
)
;

boundaryField
{
    frontandback
    {
        type            empty;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
206
(
2.03956
2.03752
2.03554
2.03362
2.03175
2.02994
2.02818
2.02647
...
)
;
    }
    slipsurface
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
167
(
2.00548
1.93659
1.87027
1.80643
1.74498
1.68585
1.62895
1.5742
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
167
(
1.96417
1.89378
1.8259
1.76045
1.69734
1.63649
1.57781
1.52123
...
)
;
    }
    bottom
    {
        type            calculated;
        value           uniform 1e-15;
    }
}


// ************************************************************************* //
