Flat-Plate-kepsilon/system/changeDictionaryDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | Tariq Abdulsalam Khamlaj                        |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      changeDictionaryDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dictionaryReplacement
{
    boundary
    {
        bottom
        {
            type            wall;
            physicalType    wall;
        }
        frontandback
        {
            type            empty;
            physicalType    empty;
        }
        slipsurface
        {
            type            symmetryPlane;
            physicalType    symmetryPlane;
        }
    }
}
// ************************************************************************* //